librbd_iscsi/yujiang/randread/logs/fio-256k.fio.log
randread-256k: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randread-256k;0;0;173844736;289729;1131;600024;0;659;3.844228;2.998062;665;1659526;14132.043387;16429.906331;1.000000%=2375;5.000000%=2670;10.000000%=2965;20.000000%=5341;30.000000%=8716;40.000000%=10551;50.000000%=11862;60.000000%=13172;70.000000%=15663;80.000000%=19005;90.000000%=25559;95.000000%=33423;99.000000%=58982;99.500000%=73924;99.900000%=130547;99.950000%=187695;99.990000%=599785;0%=0;0%=0;0%=0;669;1659532;14135.887616;16429.921828;1024;705536;100.000000%;290957.596990;68470.689782;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.485255%;67.046763%;659610;0;4878;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;16.81%;19.86%;45.64%;16.04%;1.43%;0.18%;0.02%;0.01%;0.01%;0.01%;0.00%;sda;0;22721;0;11755;0;281828;281812;1.18%

randread-256k: (groupid=0, jobs=1): err= 0: pid=4097038: Thu May 21 16:48:38 2020
   read: IOPS=1131, BW=283MiB/s (297MB/s)(166GiB/600024msec)
    slat (nsec): min=529, max=659362, avg=3844.23, stdev=2998.06
    clat (usec): min=665, max=1659.5k, avg=14132.04, stdev=16429.91
     lat (usec): min=669, max=1659.5k, avg=14135.89, stdev=16429.92
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    6],
     | 30.00th=[    9], 40.00th=[   11], 50.00th=[   12], 60.00th=[   14],
     | 70.00th=[   16], 80.00th=[   20], 90.00th=[   26], 95.00th=[   34],
     | 99.00th=[   59], 99.50th=[   74], 99.90th=[  131], 99.95th=[  188],
     | 99.99th=[  600]
   bw (  KiB/s): min= 1024, max=705536, per=100.00%, avg=290957.60, stdev=68470.69, samples=1196
   iops        : min=    4, max= 2756, avg=1136.50, stdev=267.48, samples=1196
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=16.81%, 10=19.86%, 20=45.64%, 50=16.04%
  lat (msec)   : 100=1.43%, 250=0.18%, 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=32.49%, sys=67.05%, ctx=659610, majf=0, minf=4878
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=679081,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=283MiB/s (297MB/s), 283MiB/s-283MiB/s (297MB/s-297MB/s), io=166GiB (178GB), run=600024-600024msec

Disk stats (read/write):
  sda: ios=0/22721, merge=0/11755, ticks=0/281828, in_queue=281812, util=1.18%