librbd_iscsi/yujiang/randread/logs/fio-4k.fio.log
randread-4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randread-4k;0;0;4015816;6692;1673;600023;0;134;3.308468;2.844379;501;1494747;9557.598247;10727.853538;1.000000%=888;5.000000%=1003;10.000000%=1089;20.000000%=1302;30.000000%=3620;40.000000%=7110;50.000000%=8978;60.000000%=10420;70.000000%=11730;80.000000%=14483;90.000000%=18743;95.000000%=23461;99.000000%=37486;99.500000%=46923;99.900000%=84410;99.950000%=120061;99.990000%=252706;0%=0;0%=0;0%=0;502;1494749;9560.906715;10727.873665;176;17560;100.000000%;6703.436197;3285.978064;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.548307%;66.791884%;878595;0;205244;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;4.72%;22.37%;3.65%;26.26%;34.94%;7.64%;0.34%;0.06%;0.01%;0.01%;0.00%;0.01%;0.00%;sda;0;22762;0;11479;0;260948;260932;1.12%

randread-4k: (groupid=0, jobs=1): err= 0: pid=4073804: Thu May 21 16:18:36 2020
   read: IOPS=1673, BW=6693KiB/s (6853kB/s)(3922MiB/600023msec)
    slat (nsec): min=386, max=134477, avg=3308.47, stdev=2844.38
    clat (usec): min=501, max=1494.7k, avg=9557.60, stdev=10727.85
     lat (usec): min=502, max=1494.7k, avg=9560.91, stdev=10727.87
    clat percentiles (usec):
     |  1.00th=[   889],  5.00th=[  1004], 10.00th=[  1090], 20.00th=[  1303],
     | 30.00th=[  3621], 40.00th=[  7111], 50.00th=[  8979], 60.00th=[ 10421],
     | 70.00th=[ 11731], 80.00th=[ 14484], 90.00th=[ 18744], 95.00th=[ 23462],
     | 99.00th=[ 37487], 99.50th=[ 46924], 99.90th=[ 84411], 99.95th=[120062],
     | 99.99th=[252707]
   bw (  KiB/s): min=  176, max=17560, per=100.00%, avg=6703.44, stdev=3285.98, samples=1199
   iops        : min=   44, max= 4390, avg=1675.82, stdev=821.51, samples=1199
  lat (usec)   : 750=0.02%, 1000=4.72%
  lat (msec)   : 2=22.37%, 4=3.65%, 10=26.26%, 20=34.94%, 50=7.64%
  lat (msec)   : 100=0.34%, 250=0.06%, 500=0.01%, 750=0.01%, 2000=0.01%
  cpu          : usr=32.55%, sys=66.79%, ctx=878595, majf=0, minf=205244
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1003954,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=6693KiB/s (6853kB/s), 6693KiB/s-6693KiB/s (6853kB/s-6853kB/s), io=3922MiB (4112MB), run=600023-600023msec

Disk stats (read/write):
  sda: ios=0/22762, merge=0/11479, ticks=0/260948, in_queue=260932, util=1.12%