librbd_iscsi/yujiang/randread/logs/fio-4m.fio.log
randread-4m: (g=0): rw=randread, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randread-4m;0;0;632786944;1054557;257;600050;1;248;8.107012;4.960627;15349;1734300;62132.597840;47192.756373;1.000000%=23724;5.000000%=29753;10.000000%=33423;20.000000%=38535;30.000000%=43253;40.000000%=47972;50.000000%=52690;60.000000%=58458;70.000000%=65273;80.000000%=76021;90.000000%=95944;95.000000%=121110;99.000000%=210763;99.500000%=256901;99.900000%=425721;99.950000%=1115684;99.990000%=1551892;0%=0;0%=0;0%=0;15356;1734312;62140.704852;47192.701239;8192;1261568;100.000000%;1063352.470193;129654.169188;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.830985%;67.059523%;137571;0;886;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.20%;44.48%;46.46%;8.31%;0.47%;0.01%;0.01%;0.06%;0.00%;sda;0;22407;0;11435;0;246348;246328;1.08%

randread-4m: (groupid=0, jobs=1): err= 0: pid=4112343: Thu May 21 17:08:40 2020
   read: IOPS=257, BW=1030MiB/s (1080MB/s)(603GiB/600050msec)
    slat (nsec): min=1340, max=248372, avg=8107.01, stdev=4960.63
    clat (msec): min=15, max=1734, avg=62.13, stdev=47.19
     lat (msec): min=15, max=1734, avg=62.14, stdev=47.19
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   30], 10.00th=[   34], 20.00th=[   39],
     | 30.00th=[   44], 40.00th=[   48], 50.00th=[   53], 60.00th=[   59],
     | 70.00th=[   66], 80.00th=[   77], 90.00th=[   96], 95.00th=[  122],
     | 99.00th=[  211], 99.50th=[  257], 99.90th=[  426], 99.95th=[ 1116],
     | 99.99th=[ 1552]
   bw (  MiB/s): min=    8, max= 1232, per=100.00%, avg=1038.43, stdev=126.62, samples=1191
   iops        : min=    2, max=  308, avg=259.55, stdev=31.65, samples=1191
  lat (msec)   : 20=0.20%, 50=44.48%, 100=46.46%, 250=8.31%, 500=0.47%
  lat (msec)   : 750=0.01%, 1000=0.01%, 2000=0.06%
  cpu          : usr=32.83%, sys=67.06%, ctx=137571, majf=0, minf=886
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=154489,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1030MiB/s (1080MB/s), 1030MiB/s-1030MiB/s (1080MB/s-1080MB/s), io=603GiB (648GB), run=600050-600050msec

Disk stats (read/write):
  sda: ios=0/22407, merge=0/11435, ticks=0/246348, in_queue=246328, util=1.08%