librbd_iscsi/yujiang/randread/logs/fio-64k.fio.log
randread-64k: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randread-64k;0;0;54093440;90153;1408;600018;0;1890;3.620535;3.386675;553;1168671;11353.489714;11058.491313;1.000000%=1368;5.000000%=1564;10.000000%=1712;20.000000%=2605;30.000000%=6586;40.000000%=8847;50.000000%=10289;60.000000%=11468;70.000000%=13303;80.000000%=16187;90.000000%=20840;95.000000%=26607;99.000000%=44826;99.500000%=56885;99.900000%=101187;99.950000%=126353;99.990000%=208666;0%=0;0%=0;0%=0;557;1168675;11357.110250;11058.516326;4864;240384;100.000000%;90242.002502;30209.817883;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.731906%;66.808107%;788150;0;26972;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;16.81%;6.54%;24.32%;40.99%;10.62%;0.62%;0.10%;0.01%;0.00%;0.00%;0.01%;0.00%;sda;0;23185;0;11562;0;227104;227084;1.02%

randread-64k: (groupid=0, jobs=1): err= 0: pid=4089509: Thu May 21 16:38:37 2020
   read: IOPS=1408, BW=88.0MiB/s (92.3MB/s)(51.6GiB/600018msec)
    slat (nsec): min=543, max=1890.1k, avg=3620.54, stdev=3386.67
    clat (usec): min=553, max=1168.7k, avg=11353.49, stdev=11058.49
     lat (usec): min=557, max=1168.7k, avg=11357.11, stdev=11058.52
    clat percentiles (usec):
     |  1.00th=[  1369],  5.00th=[  1565], 10.00th=[  1713], 20.00th=[  2606],
     | 30.00th=[  6587], 40.00th=[  8848], 50.00th=[ 10290], 60.00th=[ 11469],
     | 70.00th=[ 13304], 80.00th=[ 16188], 90.00th=[ 20841], 95.00th=[ 26608],
     | 99.00th=[ 44827], 99.50th=[ 56886], 99.90th=[101188], 99.95th=[126354],
     | 99.99th=[208667]
   bw (  KiB/s): min= 4864, max=240384, per=100.00%, avg=90242.00, stdev=30209.82, samples=1199
   iops        : min=   76, max= 3756, avg=1410.00, stdev=472.03, samples=1199
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=16.81%, 4=6.54%, 10=24.32%, 20=40.99%, 50=10.62%
  lat (msec)   : 100=0.62%, 250=0.10%, 500=0.01%, 2000=0.01%
  cpu          : usr=32.73%, sys=66.81%, ctx=788150, majf=0, minf=26972
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=845210,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=88.0MiB/s (92.3MB/s), 88.0MiB/s-88.0MiB/s (92.3MB/s-92.3MB/s), io=51.6GiB (55.4GB), run=600018-600018msec

Disk stats (read/write):
  sda: ios=0/23185, merge=0/11562, ticks=0/227104, in_queue=227084, util=1.02%