librbd_iscsi/yujiang/randread/logs/fio-8k.fio.log
randread-8k: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randread-8k;0;0;9691080;16150;2018;600031;0;536;3.405554;2.730681;400;1222963;7920.176140;15773.570591;1.000000%=790;5.000000%=897;10.000000%=970;20.000000%=1073;30.000000%=1187;40.000000%=1335;50.000000%=2179;60.000000%=6848;70.000000%=9502;80.000000%=11730;90.000000%=17170;95.000000%=24248;99.000000%=63700;99.500000%=93847;99.900000%=185597;99.950000%=250609;99.990000%=450887;0%=0;0%=0;0%=0;403;1222967;7923.581694;15773.650320;352;58816;100.000000%;16167.790000;10879.605467;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;33.021682%;66.470010%;1018443;0;190458;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.46%;12.24%;36.64%;4.28%;18.47%;20.81%;5.63%;1.02%;0.40%;0.04%;0.01%;0.01%;0.01%;0.00%;sda;0;21749;0;11379;0;263196;263172;1.13%

randread-8k: (groupid=0, jobs=1): err= 0: pid=4080823: Thu May 21 16:28:37 2020
   read: IOPS=2018, BW=15.8MiB/s (16.5MB/s)(9464MiB/600031msec)
    slat (nsec): min=422, max=536731, avg=3405.55, stdev=2730.68
    clat (usec): min=400, max=1222.0k, avg=7920.18, stdev=15773.57
     lat (usec): min=403, max=1222.0k, avg=7923.58, stdev=15773.65
    clat percentiles (usec):
     |  1.00th=[   791],  5.00th=[   898], 10.00th=[   971], 20.00th=[  1074],
     | 30.00th=[  1188], 40.00th=[  1336], 50.00th=[  2180], 60.00th=[  6849],
     | 70.00th=[  9503], 80.00th=[ 11731], 90.00th=[ 17171], 95.00th=[ 24249],
     | 99.00th=[ 63701], 99.50th=[ 93848], 99.90th=[185598], 99.95th=[250610],
     | 99.99th=[450888]
   bw (  KiB/s): min=  352, max=58816, per=100.00%, avg=16167.79, stdev=10879.61, samples=1200
   iops        : min=   44, max= 7352, avg=2020.92, stdev=1359.95, samples=1200
  lat (usec)   : 500=0.01%, 750=0.46%, 1000=12.24%
  lat (msec)   : 2=36.64%, 4=4.28%, 10=18.47%, 20=20.81%, 50=5.63%
  lat (msec)   : 100=1.02%, 250=0.40%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=33.02%, sys=66.47%, ctx=1018443, majf=0, minf=190458
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1211385,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=15.8MiB/s (16.5MB/s), 15.8MiB/s-15.8MiB/s (16.5MB/s-16.5MB/s), io=9464MiB (9924MB), run=600031-600031msec

Disk stats (read/write):
  sda: ios=0/21749, merge=0/11379, ticks=0/263196, in_queue=263172, util=1.13%